#! /bin/bundle
# -*- mode: ruby; coding: utf-8 -*-

# As far as I read the implementation of brew bundle, this file is
# `instance_eval`ed.  Feel free to write any dangerous ruby things
# here.

ENV['HOMEBREW_MAKE_JOBS'] = '5'

tap 'homebrew/bundle'
tap 'homebrew/command-not-found'
tap 'homebrew/services'
tap 'mike-engel/jwt-cli'
tap 'nikitabobko/homebrew-tap'

brew 'coreutils'
brew 'findutils'
brew 'gawk'
brew 'gettext'
brew 'gh'
brew 'ghq'
brew 'gist'
brew 'git-filter-repo'
brew 'git-lfs'
brew 'git'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-time'
brew 'gnupg'
brew 'grep'
brew 'gzip'
brew 'hub'
brew 'jq'
brew 'keychain'
brew 'less'
brew 'lsof'
brew 'lv'
brew 'make'
brew 'mas'
brew 'mtr'
brew 'nkf'
brew 'openssh'
brew 'parallel'
brew 'pcre'
brew 'pigz'
brew 'pixz'
brew 'pstree'
brew 'rsync'
brew 'shared-mime-info'
brew 'sl'
brew 'telnet'
brew 'tiger-vnc'
brew 'tree'
brew 'wget'
brew 'xz'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
brew 'zsh'

brew 'mike-engel/jwt-cli/jwt-cli'

cask_args appdir: "~/Applications"

cask 'font-inconsolata'
cask 'font-noto-sans'
cask 'font-noto-serif'

cask '1password', args: { appdir: "/Applications" }
cask 'aerospace'
cask 'arc'
cask 'asana'
cask 'bitwarden'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'emacs'
cask 'filen'
cask 'firefox'
cask 'gimp'
cask 'google-chrome'
cask 'keepingyouawake'
cask 'messenger'
cask 'microsoft-teams'
cask 'notion'
cask 'rustdesk'
cask 'slack'
cask 'stoplight-studio'
cask 'visual-studio-code'
cask 'wireshark' # or 'wireshark-chmodbpf'
cask 'yubico-authenticator'
cask 'zoom'

mas 'TEPRA LINK 2', id: 1614816445

vscode 'ms-azuretools.vscode-docker'
vscode 'ms-vscode-remote.remote-containers'
vscode 'redhat.vscode-yaml'
vscode 'tamasfe.even-better-toml'

__END__

brew 'actionlint'
brew 'awscli'
brew 'circleci'
brew 'doxygen'
brew 'gitlab-runner', restart_service: true
brew 'go'
brew 'graphviz'
brew 'imagemagick'
brew 'node-build'
brew 'nodenv'
brew 'pnpm'
brew 'pyenv'
brew 'rbenv'
brew 'ruby-build'
brew 'rustup'
brew 'shellcheck'
brew 'tfenv'
brew 'tmux'

cask 'mysqlworkbench'
cask 'session-manager-plugin'
